[
	{
		"name": "Enders Gate Marketplace",
		"link": "projects/web3/enders_gate_marketplace",
		"liveDemo": "https://marketplace.endersgate.gg/",
		"repo": "https://github.com/5HeadGames/EndersGate_marketplace",
		"image": "/img/eg_marketplace.png",
		"images": [
			"/img/eg_mkt/1.png",
			"/img/eg_mkt/2.png",
			"/img/eg_mkt/3.png",
			"/img/eg_mkt/4.png",
			"/img/eg_mkt/5.png",
			"/img/eg_mkt/6.png",
			"/img/eg_mkt/7.png",
			"/img/eg_mkt/8.png",
			"/img/eg_mkt/9.png",
			"/img/eg_mkt/10.png",
			"/img/eg_mkt/11.png",
			"/img/eg_mkt/12.png"
		],
		"description": "Enders Gate Marketplace is a cutting-edge NFT marketplace that provides seamless web3 integration with popular wallet providers such as Metamask, Coinbase, Wallet Connect, and Magic Connect (Create Wallet by Email). Catering specifically to the Enders Gate community, the marketplace allows users to easily view, manage, and trade their Enders Gate-related NFTs.",
		"codeDescription": {
			"paragraphs": [
				{
					"text": "Enders Gate Marketplace is a cutting-edge NFT marketplace that provides seamless web3 integration with popular wallet providers such as Metamask, Coinbase, Wallet Connect, and Magic Connect (Create Wallet by Email). Catering specifically to the Enders Gate community, the marketplace allows users to easily view, manage, and trade their Enders Gate-related NFTs."
				},
				{
					"text": "As an EG Trader, you can list your NFTs for sale on the marketplace, setting your desired price and allowing other traders to browse and purchase your items. Similarly, you can browse through the NFTs listed by other traders, adding any that catch your eye to your cart and proceeding to buy them with just a few clicks. The user-friendly interface ensures a smooth experience for both new and seasoned collectors."
				},
				{
					"text": "To support the ongoing development and maintenance of the platform, Enders Gate Marketplace charges a modest 4% fee on each sale made within the marketplace. This fee helps ensure the continued growth and improvement of the platform, enabling more features and providing a better experience for all users."
				},
				{
					"text": "So, whether you're an avid collector, an artist looking to showcase your work, or just curious about the world of NFTs, Enders Gate Marketplace offers a comprehensive solution for all your trading needs. Join the growing community and explore the exciting possibilities within the Enders Gate universe today!"
				}
			]
		}
	},
	{
		"name": "Enders Gate Website",
		"link": "projects/web3/enders_gate_website",
		"liveDemo": "https://www.endersgate.gg/",
		"image": "/img/eg_website.png",
		"images": [
			"/img/eg/1.png",
			"/img/eg/2.png",
			"/img/eg/3.png",
			"/img/eg/4.png",
			"/img/eg/5.png",
			"/img/eg/6.png"
		],
		"description": "Welcome to the Enders Gate Main Website, a one-stop destination for all things related to Enders Gate NFTs. Featuring seamless web3 integration with popular wallet providers like Metamask, Coinbase, Wallet Connect, and Magic Connect (Create Wallet by Email), the platform ensures a smooth and secure experience for users.",
		"codeDescription": {
			"paragraphs": [
				{
					"text": "Welcome to the Enders Gate Main Website, a one-stop destination for all things related to Enders Gate NFTs. Featuring seamless web3 integration with popular wallet providers like Metamask, Coinbase, Wallet Connect, and Magic Connect (Create Wallet by Email), the platform ensures a smooth and secure experience for users."
				},
				{
					"text": "The Gallery Section showcases the vast array of Enders Gate NFTs, allowing you to browse through stunning artwork and unique collectibles. Each NFT comes with a detailed description, allowing you to better understand the story and value behind every piece."
				},
				{
					"text": "In the Inventory Section, you can easily manage and view your personal collection of Enders Gate NFTs. Keep track of your acquisitions, organize your collection, and even display your favorite pieces for others to admire."
				},
				{
					"text": "Elevate your excitement with the Enders Packs, which offer a thrilling pack opening experience. Watch captivating animations as you unwrap your new acquisitions, revealing the surprise NFTs contained within. This immersive feature adds a touch of wonder and anticipation to your collecting journey."
				},
				{
					"text": "The Enders Gate Main Website goes beyond just offering NFT management and trading. It is a hub for the community, providing news, updates, and access to exclusive events. Immerse yourself in the Enders Gate universe and join a passionate network of collectors, artists, and enthusiasts. Explore, connect, and grow with Enders Gate today!"
				}
			]
		}
	},
	{
		"name": "Share Eth",
		"link": "projects/web3/share_eth",
		"liveDemo": "https://shareeth.vercel.app/",
		"repo": "https://shareeth.vercel.app/",
		"image": "/img/share_eth.png",
		"images": [
			"/img/share_eth/1.png",
			"/img/share_eth/2.png",
			"/img/share_eth/3.png",
			"/img/share_eth/4.png",
			"/img/share_eth/5.png",
			"/img/share_eth/6.png"
		],
		"description": "Introducing ShareEth, a hackathon project turned social media app that empowers content creators by enabling them to monetize their work through various income streams. Our primary goals are to ensure security and privacy for both the content and our users, while providing a dynamic and engaging user experience.",
		"codeDescription": {
			"paragraphs": [
				{
					"text": "Introducing ShareEth, a hackathon project turned social media app that empowers content creators by enabling them to monetize their work through various income streams. Our primary goals are to ensure security and privacy for both the content and our users, while providing a dynamic and engaging user experience."
				},
				{
					"text": "As we iterate on the project, we aim to achieve maximum decentralization, allowing users to have control over their content, data, and network. Although we are currently considering a centralized server for content privacy, we are actively exploring more decentralized solutions."
				},
				{
					"text": "ShareEth utilizes IPFS/Filecoin to store user-generated content, ensuring a decentralized and reliable storage system. We leverage Lens technology for the majority of the logic behind the social graph, while Superfluid manages the flow of payments for seamless monetization."
				},
				{
					"text": "For enhanced user engagement, we've integrated EPNS to deliver a more dynamic and personalized experience. Our team is constantly researching ways to make content private and secure, with options such as encryption or utilizing a private IPFS network under consideration."
				},
				{
					"text": "Join ShareEth today and take control of your content and earnings in a secure and decentralized social media platform."
				}
			]
		}
	},
	{
		"name": "C3 Blockchain",
		"link": "projects/web3/c3",
		"liveDemo": "https://c3-blockchain.vercel.app/",
		"image": "/img/c3.png",
		"images": [
			"/img/c3/1.png",
			"/img/c3/2.png",
			"/img/c3/3.png",
			"/img/c3/4.png",
			"/img/c3/5.png",
			"/img/c3/6.png",
			"/img/c3/7.png",
			"/img/c3/8.png",
			"/img/c3/9.png"
		],
		"description": "C3 blockchain consists in a L2 blockchain base in the OP Stack with Goerli as L1, where we modified the core of the EVM where gas fees implementation is located. Only users with a WorldID (as a proof of personhood) can get fees from their smart contracts. All of this allows smart contracts builders to obtain revenue from the use of their smart contracts. This solves the issue of public goods or projects such as Safe not having a solid revenue source.",
		"codeDescription": {
			"paragraphs": [
				{
					"text": "C3 blockchain consists in a L2 blockchain base in the OP Stack with Goerli as L1, where we modified the core of the EVM where gas fees implementation is located. Only users with a WorldID (as a proof of personhood) can get fees from their smart contracts. All of this allows smart contracts builders to obtain revenue from the use of their smart contracts. This solves the issue of public goods or projects such as Safe not having a solid revenue source."
				},
				{
					"text": "This project is a OP Stack hack/modification (op-geth, op-node, op-batcher, etc...) as a base of the blockchain and Worldcoin as a proof of personhood, we are getting to data from the Worldcoin Ethereum Contract. "
				},
				{
					"text": "In the frontend we are using Next.js 13, Typescript and TailwindCSS to build the landing page and the app that shows the tracking of the smart contracts with the most gas fees earned."
				}
			]
		}
	},
	{
		"name": "NFT Bolster",
		"link": "projects/web3/nft_bolster",
		"liveDemo": "https://bolster-kohl.vercel.app/",
		"image": "/img/bolster.png",
		"images": [
			"/img/bolster/1.png",
			"/img/bolster/2.png",
			"/img/bolster/3.png",
			"/img/bolster/4.png"
		],
		"description": "Bolster is a platform that understands the immense value NFTs hold in promoting culture and art. We are also aware of the extreme volatility and significant losses NFT prices can experience, such as during the crypto winter. As a result, Bolster has taken a unique approach by curating art projects that come with the option to be redeemed for physical assets.",
		"codeDescription": {
			"paragraphs": [
				{
					"text": "Bolster is a platform that understands the immense value NFTs hold in promoting culture and art. We are also aware of the extreme volatility and significant losses NFT prices can experience, such as during the crypto winter. As a result, Bolster has taken a unique approach by curating art projects that come with the option to be redeemed for physical assets."
				},
				{
					"text": "This innovative structure means that if the value of an NFT or a collection of NFTs drops below the market value of the physical asset it represents, there is an economic incentive to purchase it. This can either elevate the NFT(s) value or allow an individual to acquire the physical asset at a reduced price. If the NFT(s) is redeemed, it will be burned."
				},
				{
					"text": "To redeem an NFT or a collection of NFTs on the Bolster platform, collectors must possess the entire collection. If the collection contains only one NFT, it can be redeemed at any time. By providing this redemption option, Bolster adds an extra layer of value and stability to its NFT offerings."
				},
				{
					"text": "Join the Bolster community today, and discover a new way to engage with art and culture through our unique NFT platform. Enjoy the added security and stability of our redemption option, as you immerse yourself in the vibrant world of digital collectibles."
				}
			]
		}
	}
]
